#include "StringEx.h"
#include <string>
#include "MyFunctions.h"


//-----------------------------------------------------------------------------------------------------------------------------------------
//Дополнить класс String новыми методами и перегрузками операций.
//-----------------------------------------------------------------------------------------------------------------------------------------
//	- дополнить класс методами isEmpty - READY
// 
//	- дополнить класс методами size - READY (.clearObj)
// 
//	- дополнить класс методами clear - READY
// 
//	- добавить по необходимости иные методы , упрощающие работу с классом
//
//	- добавить перегрузку оператора вывода в консоль - READY
// 
//	- добавить конструктор копирования и перегрузку оператора присваивания - READY (Конструктор копирования был реализован еще в 4 задании)
// 
//	- добавить перегрузку оператора индексации - Performed
// 
//	- добавить перегрузку операторов сравнения - Performed
//-----------------------------------------------------------------------------------------------------------------------------------------

// Весь вывод сделал в мейне.
// У метода .clear было изменено название на .clearObj

int main()
{
	setlocale( 0 , "rus" );

	//-------------------------------------------------
	StringEx newStringEx{ "Hello my first stroke" };
	std::cout << RED_TEXT << "Метод SIZE:\n" << DEFAULT_TEXT;
	std::cout << newStringEx << std::endl;
	std::cout << newStringEx.size() << std::endl;

	//-------------------------------------------------
	StringEx newString;
	StringEx newStrEx{ "Hello my first stroke" };
	std::cout << RED_TEXT << "Метод isEmpty:\n" << DEFAULT_TEXT;
	std::cout << newStrEx.isEmpty() << std::endl;
	std::cout << newString.isEmpty() << std::endl;

	//-------------------------------------------------

	return 0;
}